package algs.assignments.jam;

/**
 * Расстояние редактирования (грубо говоря, это число показывает, на сколько похожи 2 слова).
 *
 * """Расстояние Левенштейна (также редакционное расстояние или дистанция редактирования) между двумя
 *    строками в теории информации и компьютерной лингвистике — это минимальное количество операций
 *    вставки одного символа, удаления одного символа и замены одного символа на другой, необходимых
 *    для превращения одной строки в другую.
 *
 *    Расстояние Левенштейна и его обобщения активно применяется:
 *      - для исправления ошибок в слове (в поисковых системах, базах данных, при вводе текста,
 *        при автоматическом распознавании отсканированного текста или речи).
 *      - для сравнения текстовых файлов утилитой diff и ей подобными. Здесь роль «символов» играют
 *        строки, а роль «строк» — файлы.
 *      - в биоинформатике для сравнения генов, хромосом и белков.
 *
 * """ wikipedia
 *
 * Пример (выравнивание вставкой, удаление и заменой):
 * поли--омы
 * пали-ром-
 * Стоимость = 4
 *
 * todo implement
 * @author Serj Sintsov
 */
public class ShortestEditDistance {



}
